CodeSystem: CS_THCC_QnType
Id: cs-thcc-qn-type
Title: "ชนิดแบบสอบถาม 43 แฟ้ม plus"
Description:  "ชนิดแบบสอบถามที่ใช้ประกอบการเก็บข้อมูลตามโครงสร้างข้อมูล 43 แฟ้มเดิมและโครงสร้างอื่น ๆ"
* ^url = $CS_THCC_QnType
* #HOME "ข้อมูลสุขาภิบาลของหลังคาเรือน ในแฟ้ม HOME"
* #VILLAGE "ข้อมูลทั่วไปและข้อมูลที่เกี่ยวข้องกับสุขภาพของชุมชน ในแฟ้ม VILLAGE"
* #DENTAL "แบบสำรวจการตรวจสภาวะทันตสุขภาพของฟัน ในแฟ้ม DENTAL"
* #HOMEVIST "แบบบันทึกสุขภาพ การให้บริการในชุมชน ในแฟ้ม COMMUNITY_SERVICE"
* #REFER_HISTORY "ข้อมูลประวัติการส่งต่อผู้ป่วย (ทั้งกรณีส่งออก และรับเข้า)"